[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=32
subdivisions=8
width=640
height=640
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.00261
burn_in=1000
max_batches = 30000
policy=steps
steps=24000,27000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=28
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=56
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=56
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=28
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=28
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[dropout]
dropblock=1
dropblock_size_abs=7
probability=.1

[convolutional]
batch_normalize=1
filters=112
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=56
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=56
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=112
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[dropout]
dropblock=1
dropblock_size_abs=7
probability=.1

[convolutional]
batch_normalize=1
filters=224
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=112
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=112
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=224
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[dropout]
dropblock=1	
dropblock_size_abs=7
probability=.1

[convolutional]
batch_normalize=1
filters=448
size=3
stride=1
pad=1
activation=leaky

##################################

[convolutional]
batch_normalize=1
filters=224
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=448
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=27
activation=linear



[yolo]
mask = 2,3,4
anchors = 8,14,  16,28,  23,47,  40,80,  53,41,  87,132
classes=4
num=6
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=0
resize=1.5
nms_kind=greedynms
beta_nms=0.6

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=112
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 25

[convolutional]
batch_normalize=1
filters=224
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=27
activation=linear

[yolo]
mask = 0,1,2
anchors = 8,14,  16,28,  23,47,  40,80,  53,41,  87,132
classes=4
num=6
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=0
resize=1.5
nms_kind=greedynms
beta_nms=0.6
